# State Student Spending Case Study
#### Examining any relationship between student sucess or lack thereof with how much money the state has invested

### Necessary Steps for Data Story
##### 1) Clean the Data 
    a. Import Data
    b. Transform variables
##### 2) Exploratory Data Analysis
    a. Visualize the data
##### 3) Preprocess and Train Data
##### 4) Create Machine Learning Model
##### 5) Summarize Findings

In [1]:
#import necessary modules

import pandas as pd
import numpy as np

# 1a. Import Data

In [2]:
#import Graduation rate, Dropout rate, State Spending, Population, & State GDP data
Grad = pd.read_csv('Data/Completion1318edit.csv')
Drop = pd.read_csv('Data/Dropout1318edit.csv')
StateSpend = pd.read_excel('Data/StateSpendingStudents.xlsx')
Pop = pd.read_csv('Data/Pop10-19.csv')
GDP = pd.read_csv('Data/State Quarterly GDP 2005 - 2021 - Sheet1.csv')

In [3]:
#import tax data 
Tax13 = pd.read_csv('Data/2013 State Taxes.csv').replace('X', 0)
Tax14 = pd.read_csv('Data/2014 State Taxes.csv').replace('X', 0)
Tax15 = pd.read_csv('Data/2015 State Taxes.csv').replace('X', 0)
Tax16 = pd.read_csv('Data/2016 State Taxes.csv').replace('X', 0)
Tax17 = pd.read_csv('Data/2017 State Taxes.csv').replace('X', 0)
Tax18 = pd.read_csv('Data/2018 State Taxes.csv').replace('X', 0)
Tax19 = pd.read_csv('Data/2019 State Taxes.csv').replace('X', 0)


#Note to self to automate process:
#Try a dictionary. Start with empty dictionary. Wild cards to read itieratively * .csv

## Cleaning Tax Data

In [4]:
#Examing the column names: Need to change them to match the rest of the data
#Tax13.columns

In [5]:
#Dictionary to change state abbreviations to full state names
us_state_abbrev = {
    'AL': 'Alabama',
    'AK': 'Alaska',
    'AZ': 'Arizona',
    'AR': 'Arkansas',
    'CA': 'California',
    'CO': 'Colorado',
    'CT': 'Connecticut',
    'DE': 'Delaware',
    'FL': 'Florida',
    'GA': 'Georgia',
    'HI': 'Hawaii',
    'ID': 'Idaho',
    'IL': 'Illinois',
    'IN': 'Indiana',
    'IA': 'Iowa',
    'KS': 'Kansas',
    'KY': 'Kentucky',
    'LA': 'Louisiana',
    'ME': 'Maine',
    'MD': 'Maryland',
    'MA': 'Massachusetts',
    'MI': 'Michigan',
    'MN': 'Minnesota',
    'MS': 'Mississippi',
    'MO': 'Missouri',
    'MT': 'Montana',
    'NE': 'Nebraska',
    'NV': 'Nevada',
    'NH': 'New Hampshire',
    'NJ': 'New Jersey',
    'NM': 'New Mexico',
    'NY': 'New York',
    'NC': 'North Carolina',
    'ND': 'North Dakota',
    'OH': 'Ohio',
    'OK': 'Oklahoma',
    'OR': 'Oregon',
    'PA': 'Pennsylvania',
    'RI': 'Rhode Island',
    'SC': 'South Carolina',
    'SD': 'South Dakota',
    'TN': 'Tennessee',
    'TX': 'Texas',
    'UT': 'Utah',
    'VT': 'Vermont',
    'VA': 'Virginia',
    'WA': 'Washington',
    'WV': 'West Virginia',
    'WI': 'Wisconsin',
    'WY': 'Wyoming',
    'District of Columbia': 'DC',
}

In [6]:
#Load all the individual tax files into one frame with an appropriate year varibable

TaxList = [Tax13, Tax14, Tax15, Tax16, Tax17, Tax18, Tax19]

TaxFile = pd.DataFrame()


initial_year = 2013
for loc_file in TaxList:
  loc_file = loc_file.iloc[:,1:]
  loc_file['Year'] = str(initial_year)
  loc_file = loc_file.melt(id_vars='Year', value_name = 'tax_all', var_name='State')
  TaxFile  = TaxFile.append(loc_file)
  initial_year = initial_year + 1

In [7]:
#Sum all the different types of tax categories
TaxFile['tax_all'] = TaxFile['tax_all'].astype('float')

AllTaxes = TaxFile.groupby(['State', 'Year'])['tax_all'].sum().reset_index()
AllTaxes.head()

  State  Year    tax_all
0    AK  2013  5132811.0
1    AK  2014  3392870.0
2    AK  2015  1363350.0
3    AK  2016   896921.0
4    AK  2017  1208929.0

In [8]:
#Fix the naming

AllTaxes['State'] = AllTaxes['State'].replace(us_state_abbrev)
AllTaxes.head()

    State  Year    tax_all
0  Alaska  2013  5132811.0
1  Alaska  2014  3392870.0
2  Alaska  2015  1363350.0
3  Alaska  2016   896921.0
4  Alaska  2017  1208929.0

## Cleaning Median Income Data

In [9]:
#Read in Median Income (Deleted out Standard Deviation as well as repetitive information from original file)
MedianInc = pd.read_csv('Data/median_income_cleaned.csv')

#Flip
MedianInc = MedianInc.melt(id_vars = 'State', var_name='Year', value_name = 'MedInc')

MedianInc.head()
#Delete unnecessary columns and repetitive information.

           State  Year  MedInc
0  United States  2018   63179
1        Alabama  2018   49936
2         Alaska  2018   68734
3        Arizona  2018   62283
4       Arkansas  2018   49781

## Cleaning Graduation and Drop Out Data

In [10]:
#examine data
print(Grad.columns)

Index(['State', '2012-2013', '2013-2014', '2014-2015', '2015-2016',
       '2016-2017', '2017-2018'],
      dtype='object')

In [11]:
#Rename columns so they match years in other files.
oldname = Grad.columns
newname = ['State', 2013, 2014, 2015, 2016, 2017, 2018 ]
Grad = Grad.rename(columns=dict(zip(oldname, newname)))

#Flip so States are columns
Grad = Grad.melt(id_vars = ['State'], var_name='Year', value_name = 'Graduates')


#Examine
Grad.head()

           State  Year  Graduates
0  United States  2013       81.4
1        Alabama  2013       80.0
2         Alaska  2013       71.8
3        Arizona  2013       75.1
4       Arkansas  2013       84.9

In [12]:
#examine data
print(Drop.head())
print(Drop.columns)

           State  2013  2014  2015  2016  2017  2018
0  United States   6.8   6.3   6.0   5.8   5.4   5.3
1        Alabama   8.9   7.7   7.4   6.9   6.6   5.4
2         Alaska   6.2   2.8   8.8   5.6   5.3   4.4
3        Arizona   9.4   8.5   9.2   7.6   8.0   7.7
4       Arkansas   6.8   6.8   6.7   7.2   5.7   5.6
Index(['State', '2013', '2014', '2015', '2016', '2017', '2018'], dtype='object')

In [13]:
#Flip so States are columns
Drop = Drop.melt(id_vars = ['State'], var_name='Year', value_name = 'Dropout')

#Examine
Drop.head()

           State  Year  Dropout
0  United States  2013      6.8
1        Alabama  2013      8.9
2         Alaska  2013      6.2
3        Arizona  2013      9.4
4       Arkansas  2013      6.8

In [14]:
Drop.tail()

             State  Year  Dropout
307       Virginia  2018      3.4
308     Washington  2018      6.0
309  West Virginia  2018      6.4
310      Wisconsin  2018      4.4
311        Wyoming  2018      2.8

## Clean State Spending Data

In [15]:
#StateSpend.head() to examine data before cleaning

In [16]:
#Realign with States as columns
StateSpend.rename(columns = {'state': 'State'}, inplace = True)
StateSpend = StateSpend.melt(id_vars = ['State'], var_name='Year', value_name = 'StateSpend')
StateSpend.head()

#Examine
print(StateSpend.head())

        State  Year  StateSpend
0     Alabama  1997   3271969.0
1      Alaska  1997   1042311.0
2     Arizona  1997   3388165.0
3    Arkansas  1997   1960613.0
4  California  1997  28708364.0

## Clean Population Data

In [17]:
#Examine the Population
# print(Pop.head())

In [18]:
#Fix geographic area names & delete unnecessary strings

Pop = Pop.drop(columns = ['Census', 'Estimates Base']).iloc[:58,]
Pop['Geographic Area'] = Pop['Geographic Area'].str.replace('.','')


# Combine and examine
Pop = Pop.melt(id_vars = 'Geographic Area',var_name='Year',value_name = 'Population')
Pop.tail()

    Geographic Area  Year Population
555        Virginia  2019  8,535,519
556      Washington  2019  7,614,893
557   West Virginia  2019  1,792,147
558       Wisconsin  2019  5,822,434
559         Wyoming  2019    578,759

In [19]:
#Change column name to match other datasets
Pop = Pop.rename(columns={'Geographic Area' : 'State'})
Pop.head()

           State  Year   Population
0  United States  2010  309,321,666
1      Northeast  2010   55,380,134
2        Midwest  2010   66,974,416
3          South  2010  114,866,680
4           West  2010   72,100,436

In [20]:
Pop['Population'] = Pop['Population'].replace(" ' '", '')
Pop.head()

           State  Year   Population
0  United States  2010  309,321,666
1      Northeast  2010   55,380,134
2        Midwest  2010   66,974,416
3          South  2010  114,866,680
4           West  2010   72,100,436

In [21]:
#Remove commas from ints

for x in range(len(Pop)):
    Pop['Population'][x] = Pop['Population'][x].replace(',' , '')

In [22]:
Pop.head()

           State  Year Population
0  United States  2010  309321666
1      Northeast  2010   55380134
2        Midwest  2010   66974416
3          South  2010  114866680
4           West  2010   72100436

## Clean GDP  Data

In [23]:
#Examine GDP data before edits
# GDP.head()

In [24]:
# In order to average the GDP by year we need to extract the year
GDP['Year'] = GDP['DATE'].str[:4]
GDP.drop(columns = 'DATE', inplace = True)
GDP.head()

,Alabama,Alaska,Arizona,Arkansas,California,Colorado,Connecticut,Delaware,District of Columbia,Florida,...,Tennessee,Texas,Utah,Vermont,Virginia,Washington,West Virginia,Wisconsin,Wyoming,Year
0,153077.8,37393.9,219879.5,87648.2,1071327.2,215960.0,205563.8,50938.8,84367.6,679535.2,...,224177.7,959728.9,90791.3,23305.0,351558.7,289799.4,51590.1,222355.1,25403.1,2005
1,155409.9,38641.2,225374.3,88484.4,1147944.3,218742.0,207535.4,49992.1,85216.8,688958.5,...,225712.9,966652.1,92408.8,23288.1,358082.4,294263.7,52859.3,224122.0,26571.8,2005
2,156809.7,40259.9,232290.1,89890.7,1247734.4,222965.7,208749.0,50351.7,85499.3,708198.9,...,229952.8,993026.3,95362.0,23560.3,365491.2,295654.5,53610.3,228348.1,27453.0,2005
3,160315.8,42859.7,235386.5,92549.3,1366166.5,223561.9,212795.6,56830.1,86313.2,712347.7,...,232661.9,1025403.5,98650.0,23850.2,368236.9,303717.2,55111.1,227537.6,29448.8,2005
4,161732.8,42664.7,242418.5,92836.0,1387551.8,228594.0,221184.4,54220.3,87757.7,732154.4,...,236210.0,1054437.0,102069.5,24289.8,375995.3,310466.5,55639.7,232585.7,30455.1,2006

In [25]:
#Melt it down 
GDP = GDP.melt(id_vars = ['Year'], var_name='State', value_name = 'GDP')
GDP.head()

   Year    State       GDP
0  2005  Alabama  153077.8
1  2005  Alabama  155409.9
2  2005  Alabama  156809.7
3  2005  Alabama  160315.8
4  2006  Alabama  161732.8

In [26]:
#Find the average yearly GDP
YearlyGDP = GDP.groupby(['State', 'Year'])['GDP'].mean().reset_index()

In [27]:
YearlyGDP.head()

     State  Year        GDP
0  Alabama  2005  156403.30
1  Alabama  2006  164347.85
2  Alabama  2007  170263.85
3  Alabama  2008  172677.25
4  Alabama  2009  169128.50

## Clean Unemployment Rates

In [28]:
# Empty data frame
Unemployment = pd.DataFrame()


for i in np.arange(2009,2018,1):
    print("Reading: {}".format(str(i)))
    
    year_data = pd.read_excel('Data/UnemploymentRateData_Parsed.xlsx', sheet_name = str(i))
    melt_data = pd.melt(year_data, id_vars = 'State', var_name = ['Month'], value_name = 'value')

    aggregated_data = melt_data.groupby('State').agg({'value' : ['min', 'max', 'mean']}).reset_index()
    aggregated_data.columns = ['State', 'min_unemploymentRate', 'max_unemploymentRate', 'mean_unemploymentRate']
    aggregated_data['Year'] = str(i)
    
# Logic to add each years data to the end of previously created data
Unemployment = Unemployment.append(aggregated_data)

Unemployment.head()

Reading: 2009
Reading: 2010
Reading: 2011
Reading: 2012
Reading: 2013
Reading: 2014
Reading: 2015
Reading: 2016
Reading: 2017

,State,min_unemploymentRate,max_unemploymentRate,mean_unemploymentRate,Year
0,Alabama,3.8,5.5,4.408333,2017
1,Alaska,7.0,7.2,7.141667,2017
2,Arizona,4.7,5.2,4.858333,2017
3,Arkansas,3.6,3.7,3.666667,2017
4,California,4.5,5.2,4.775000,2017

## Merge ALL the clean files

In [29]:
MedianInc['Year']

0       2018
1       2018
2       2018
3       2018
4       2018
        ...
1191    1995
1192    1995
1193    1995
1194    1995
1195    1995
Name: Year, Length: 1196, dtype: object

In [30]:
#Change them all to strings because??

Grad['Year'] = Grad['Year'].astype('str')
Grad['State'] = Grad['State'].astype('str')

Drop['Year'] = Drop['Year'].astype('str')
Drop['State'] = Drop['State'].astype('str')

StateSpend['Year'] = StateSpend['Year'].astype('str')
StateSpend['State'] = StateSpend['State'].astype('str')

#Pop['Population'] = Pop['Population'].astype('Float64')

MedianInc['Year'] = MedianInc['Year'].astype('str')
MedianInc['State'] = MedianInc['State'].astype('str')
#MedianInc['MedInc'] = MedianInc['MedInc'].astype('Float64')

In [31]:
#merge graduate and drop data
grad_drop_merge = Grad.merge(Drop, on = ['Year', 'State'], how = 'left')
grad_drop_merge.head()

           State  Year  Graduates  Dropout
0  United States  2013       81.4      6.8
1        Alabama  2013       80.0      8.9
2         Alaska  2013       71.8      6.2
3        Arizona  2013       75.1      9.4
4       Arkansas  2013       84.9      6.8

In [32]:
#Merge state spending data
all_spend_merge = grad_drop_merge.merge(StateSpend, on = ['Year', 'State'], how = 'left')
all_spend_merge.head()

           State  Year  Graduates  Dropout  StateSpend
0  United States  2013       81.4      6.8         NaN
1        Alabama  2013       80.0      8.9   6461916.0
2         Alaska  2013       71.8      6.2   2202551.0
3        Arizona  2013       75.1      9.4   6675200.0
4       Arkansas  2013       84.9      6.8   4222408.0

In [33]:
# Merge in population
all_pop_merge = all_spend_merge.merge(Pop, on = ['Year', 'State'], how = 'left')
all_pop_merge.head()

           State  Year  Graduates  Dropout  StateSpend Population
0  United States  2013       81.4      6.8         NaN  315993715
1        Alabama  2013       80.0      8.9   6461916.0    4830081
2         Alaska  2013       71.8      6.2   2202551.0     737068
3        Arizona  2013       75.1      9.4   6675200.0    6632764
4       Arkansas  2013       84.9      6.8   4222408.0    2959400

In [34]:
#Merge in Taxes
all_tax_merge = all_pop_merge.merge(AllTaxes, on = ['Year', 'State'], how = 'left')
all_tax_merge.head()

           State  Year  Graduates  Dropout  StateSpend Population     tax_all
0  United States  2013       81.4      6.8         NaN  315993715         NaN
1        Alabama  2013       80.0      8.9   6461916.0    4830081   9270919.0
2         Alaska  2013       71.8      6.2   2202551.0     737068   5132811.0
3        Arizona  2013       75.1      9.4   6675200.0    6632764  13796918.0
4       Arkansas  2013       84.9      6.8   4222408.0    2959400   8586767.0

In [35]:
#Merge in Median Income
all_median_merge = all_tax_merge.merge(MedianInc, on = ['Year', 'State'], how = 'left')
all_median_merge.tail()

,State,Year,Graduates,Dropout,StateSpend,Population,tax_all,MedInc
307,Virginia,2018,87.5,3.4,NaN,8501286,24315846.0,77151.0
308,Washington,2018,86.7,6.0,NaN,7523869,26579324.0,79726.0
309,West Virginia,2018,90.2,6.4,NaN,1804291,5443291.0,50573.0
310,Wisconsin,2018,89.7,4.4,NaN,5807406,18717467.0,62629.0
311,Wyoming,2018,81.7,2.8,NaN,577601,1837401.0,62539.0

In [36]:
#Merge in GDP
all_gdp_merge = all_median_merge.merge(YearlyGDP, on = ['Year', 'State'], how = 'left')
all_gdp_merge.head()

,State,Year,Graduates,Dropout,StateSpend,Population,tax_all,MedInc,GDP
0,United States,2013,81.4,6.8,NaN,315993715,NaN,NaN,NaN
1,Alabama,2013,80.0,8.9,6461916.0,4830081,9270919.0,NaN,192166.525
2,Alaska,2013,71.8,6.2,2202551.0,737068,5132811.0,NaN,56625.250
3,Arizona,2013,75.1,9.4,6675200.0,6632764,13796918.0,NaN,275007.525
4,Arkansas,2013,84.9,6.8,4222408.0,2959400,8586767.0,NaN,112764.575

In [37]:
#Merge in Unemployment
all_merge = all_gdp_merge.merge(Unemployment, on = ['Year', 'State'], how = 'left')
all_merge.tail()

,State,Year,Graduates,Dropout,StateSpend,Population,tax_all,MedInc,GDP,min_unemploymentRate,max_unemploymentRate,mean_unemploymentRate
307,Virginia,2018,87.5,3.4,NaN,8501286,24315846.0,77151.0,533510.425,NaN,NaN,NaN
308,Washington,2018,86.7,6.0,NaN,7523869,26579324.0,79726.0,575416.700,NaN,NaN,NaN
309,West Virginia,2018,90.2,6.4,NaN,1804291,5443291.0,50573.0,77632.500,NaN,NaN,NaN
310,Wisconsin,2018,89.7,4.4,NaN,5807406,18717467.0,62629.0,337553.100,NaN,NaN,NaN
311,Wyoming,2018,81.7,2.8,NaN,577601,1837401.0,62539.0,39703.150,NaN,NaN,NaN

In [38]:
all_merge['Year'] = all_merge['Year'].astype('int64') 
all_merge['Dropout'] = all_merge['Dropout'].astype('float64') 
all_merge['Population'] = all_merge['Population'].astype('float64') 
all_merge.dtypes

State                     object
Year                       int64
Graduates                float64
Dropout                  float64
StateSpend               float64
Population               float64
tax_all                  float64
MedInc                   float64
GDP                      float64
min_unemploymentRate     float64
max_unemploymentRate     float64
mean_unemploymentRate    float64
dtype: object

In [49]:
all_merge[all_merge['Year'] == 2014]

,State,Year,Graduates,Dropout,StateSpend,Population,tax_all,MedInc,GDP,min_unemploymentRate,max_unemploymentRate,mean_unemploymentRate
52,United States,2014,82.3,6.3,NaN,318301008.0,NaN,53657.0,NaN,NaN,NaN,NaN
53,Alabama,2014,86.3,7.7,6600333.0,4841799.0,9296846.0,42278.0,195037.675,NaN,NaN,NaN
54,Alaska,2014,71.1,2.8,2202685.0,736283.0,3392870.0,67629.0,55750.575,NaN,NaN,NaN
55,Arizona,2014,75.7,8.5,7065613.0,6730413.0,13424271.0,49254.0,284851.375,NaN,NaN,NaN
56,Arkansas,2014,86.9,6.8,4299286.0,2967392.0,8917322.0,44922.0,116151.750,NaN,NaN,NaN
57,California,2014,81.0,6.0,59043948.0,38596972.0,138131690.0,60487.0,NaN,NaN,NaN,NaN
58,Colorado,2014,77.3,6.4,7405899.0,5350101.0,11755394.0,60940.0,305690.875,NaN,NaN,NaN
59,Connecticut,2014,87.0,4.6,8310423.0,3594524.0,15937742.0,70161.0,248778.850,NaN,NaN,NaN
60,Delaware,2014,87.0,6.5,1721283.0,932487.0,3176169.0,57522.0,67549.750,NaN,NaN,NaN
61,District of Columbia,2014,61.4,5.0,2058261.0,662328.0,NaN,NaN,119722.800,NaN,NaN,NaN
62,Florida,2014,76.1,7.1,23146180.0,19845911.0,36335598.0,46140.0,840386.450,NaN,NaN,NaN
63,Georgia,2014,72.5,7.0,15270387.0,10067278.0,18618093.0,49555.0,485282.525,NaN,NaN,NaN
64,Hawaii,2014,81.8,5.0,1890456.0,1414538.0,6052795.0,71223.0,77819.325,NaN,NaN,NaN
65,Idaho,2014,77.3,6.4,1831321.0,1631112.0,3669222.0,53438.0,63799.425,NaN,NaN,NaN
66,Illinois,2014,86.0,5.1,23319288.0,12884493.0,39922538.0,54916.0,766120.800,NaN,NaN,NaN
67,Indiana,2014,87.9,8.0,8408339.0,6593644.0,16846961.0,48060.0,325008.250,NaN,NaN,NaN
68,Iowa,2014,90.5,5.0,5203414.0,3109350.0,8572532.0,57810.0,172121.900,NaN,NaN,NaN
69,Kansas,2014,85.7,5.9,4484069.0,2900475.0,7334481.0,53444.0,148942.725,NaN,NaN,NaN
70,Kentucky,2014,87.5,6.4,5997108.0,4414349.0,11103545.0,42786.0,186419.000,NaN,NaN,NaN
71,Louisiana,2014,74.6,10.6,7086738.0,4644013.0,9695281.0,42406.0,237717.075,NaN,NaN,NaN
72,Maine,2014,86.5,4.7,2180010.0,1330513.0,3847181.0,51710.0,55826.650,NaN,NaN,NaN
73,Maryland,2014,86.4,6.0,11287730.0,5957283.0,18929069.0,76165.0,353248.650,NaN,NaN,NaN
74,Massachusetts,2014,86.1,3.8,13602492.0,6762596.0,25237003.0,63151.0,473051.975,NaN,NaN,NaN
75,Michigan,2014,78.6,6.0,14929967.0,9929848.0,25100605.0,52005.0,448572.075,NaN,NaN,NaN
76,Minnesota,2014,81.2,4.0,9157300.0,5451079.0,23245827.0,67244.0,322690.250,NaN,NaN,NaN
77,Mississippi,2014,77.6,8.4,3884541.0,2990468.0,7574515.0,35521.0,103519.775,NaN,NaN,NaN
78,Missouri,2014,87.3,5.8,8601130.0,6056202.0,11240654.0,56630.0,284237.250,NaN,NaN,NaN
79,Montana,2014,85.4,6.7,1536136.0,1021869.0,2655553.0,51102.0,44608.425,NaN,NaN,NaN
80,Nebraska,2014,89.7,3.9,3456540.0,1879321.0,4887753.0,56870.0,111386.825,NaN,NaN,NaN
81,Nevada,2014,70.0,8.6,3648652.0,2817628.0,7143169.0,49875.0,134518.375,NaN,NaN,NaN
82,New Hampshire,2014,88.1,3.7,2623529.0,1333341.0,2285717.0,73397.0,72304.425,NaN,NaN,NaN
83,New Jersey,2014,88.6,4.6,24374006.0,8864525.0,29679226.0,65243.0,545465.325,NaN,NaN,NaN
84,New Mexico,2014,68.5,9.5,2894699.0,2089568.0,5757432.0,46686.0,92586.275,NaN,NaN,NaN
85,New York,2014,77.8,6.0,56565792.0,19651049.0,76978982.0,54310.0,1425724.150,NaN,NaN,NaN
86,North Carolina,2014,83.9,5.8,11962562.0,9932887.0,23470294.0,46784.0,476260.225,NaN,NaN,NaN
87,North Dakota,2014,87.2,5.3,1220424.0,737401.0,6120435.0,60730.0,58679.900,NaN,NaN,NaN
88,Ohio,2014,81.8,6.1,18902152.0,11602700.0,27020507.0,49644.0,592876.200,NaN,NaN,NaN
89,Oklahoma,2014,82.7,7.9,4945306.0,3878187.0,9103302.0,47199.0,193546.375,NaN,NaN,NaN
90,Oregon,2014,72.0,6.8,5648365.0,3963244.0,9680004.0,58875.0,188777.500,NaN,NaN,NaN
91,Pennsylvania,2014,85.3,5.5,24073322.0,12788313.0,34192869.0,55173.0,691173.225,NaN,NaN,NaN
92,Rhode Island,2014,80.8,6.1,2191975.0,1055936.0,2974435.0,58633.0,54297.725,NaN,NaN,NaN
93,South Carolina,2014,80.1,7.3,6972009.0,4823617.0,9004192.0,44929.0,191981.500,NaN,NaN,NaN
94,South Dakota,2014,82.7,6.6,1114420.0,849129.0,1608496.0,53053.0,46369.875,NaN,NaN,NaN
95,Tennessee,2014,87.2,5.6,8228575.0,6541223.0,11806329.0,43716.0,303788.825,NaN,NaN,NaN
96,Texas,2014,88.3,7.5,40392404.0,26964333.0,55146619.0,53875.0,1568070.750,NaN,NaN,NaN
97,Utah,2014,83.9,6.6,3685048.0,2936879.0,6312489.0,63383.0,141528.000,NaN,NaN,NaN
98,Vermont,2014,87.8,2.7,1471609.0,625214.0,2962531.0,60708.0,29690.675,NaN,NaN,NaN
99,Virginia,2014,85.3,4.2,14151467.0,8310993.0,18930418.0,66155.0,464514.400,NaN,NaN,NaN
100,Washington,2014,78.2,7.1,10568308.0,7054655.0,19447899.0,59068.0,442930.000,NaN,NaN,NaN
101,West Virginia,2014,84.5,6.7,2852013.0,1849489.0,5386588.0,39552.0,71769.175,NaN,NaN,NaN
102,Wisconsin,2014,88.6,4.7,9562448.0,5751525.0,16364516.0,58080.0,293836.700,NaN,NaN,NaN
103,Wyoming,2014,78.6,4.3,1453975.0,582531.0,2263387.0,55690.0,39431.675,NaN,NaN,NaN

# Begin Exploratory Data Analysis

In [39]:
#Limit to years of interest
#StateSpendTrain = StateSpend.iloc[16:20]

#State Spend Documentation ends after 2016
#StateSpendTest = StateSpend.iloc[19:]

#print(StateSpendTrain)
#print(StateSpendTest)